Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_cnano/pic32cm_ls00_map_examples/begin/systick_periodic_timeout/firmware/systick_periodic_timeout_secure/src/packs/PIC32CM5164LS00048_DFP/component/pac.h
#define PAC_STATUSC_SERCOM_Pos                _UINT32_(1)                                          /* (PAC_STATUSC Position) SERCOMx APB Protect Enable */
#define PAC_STATUSC_SERCOM_Msk                (_UINT32_(0x3F) << PAC_STATUSC_SERCOM_Pos)           /* (PAC_STATUSC Mask) SERCOM */
#define PAC_STATUSC_SERCOM(value)             (PAC_STATUSC_SERCOM_Msk & (_UINT32_(value) << PAC_STATUSC_SERCOM_Pos)) 
#define PAC_STATUSC_TC_Pos                    _UINT32_(7)                                          /* (PAC_STATUSC Position) TCx APB Protect Enable */
#define PAC_STATUSC_TC_Msk                    (_UINT32_(0x7) << PAC_STATUSC_TC_Pos)                /* (PAC_STATUSC Mask) TC */
#define PAC_STATUSC_TC(value)                 (PAC_STATUSC_TC_Msk & (_UINT32_(value) << PAC_STATUSC_TC_Pos)) 
#define PAC_STATUSC_TCC_Pos                   _UINT32_(10)                                         /* (PAC_STATUSC Position) TCCx APB Protect Enable */
#define PAC_STATUSC_TCC_Msk                   (_UINT32_(0xF) << PAC_STATUSC_TCC_Pos)               /* (PAC_STATUSC Mask) TCC */
#define PAC_STATUSC_TCC(value)                (PAC_STATUSC_TCC_Msk & (_UINT32_(value) << PAC_STATUSC_TCC_Pos)) 

/* -------- PAC_NONSECA : (PAC Offset: 0x54) ( R/ 32) Peripheral non-secure status - Bridge A -------- */
#define PAC_NONSECA_RESETVALUE                _UINT32_(0x00)                                       /*  (PAC_NONSECA) Peripheral non-secure status - Bridge A  Reset Value */

#define PAC_NONSECA_PAC_Pos                   _UINT32_(0)                                          /* (PAC_NONSECA) PAC Non-Secure Position */
#define PAC_NONSECA_PAC_Msk                   (_UINT32_(0x1) << PAC_NONSECA_PAC_Pos)               /* (PAC_NONSECA) PAC Non-Secure Mask */
#define PAC_NONSECA_PAC(value)                (PAC_NONSECA_PAC_Msk & (_UINT32_(value) << PAC_NONSECA_PAC_Pos)) /* Assigment of value for PAC in the PAC_NONSECA register */
#define PAC_NONSECA_PM_Pos                    _UINT32_(1)                                          /* (PAC_NONSECA) PM Non-Secure Position */
#define PAC_NONSECA_PM_Msk                    (_UINT32_(0x1) << PAC_NONSECA_PM_Pos)                /* (PAC_NONSECA) PM Non-Secure Mask */
#define PAC_NONSECA_PM(value)                 (PAC_NONSECA_PM_Msk & (_UINT32_(value) << PAC_NONSECA_PM_Pos)) /* Assigment of value for PM in the PAC_NONSECA register */
#define PAC_NONSECA_MCLK_Pos                  _UINT32_(2)                                          /* (PAC_NONSECA) MCLK Non-Secure Position */
#define PAC_NONSECA_MCLK_Msk                  (_UINT32_(0x1) << PAC_NONSECA_MCLK_Pos)              /* (PAC_NONSECA) MCLK Non-Secure Mask */
#define PAC_NONSECA_MCLK(value)               (PAC_NONSECA_MCLK_Msk & (_UINT32_(value) << PAC_NONSECA_MCLK_Pos)) /* Assigment of value for MCLK in the PAC_NONSECA register */
#define PAC_NONSECA_RSTC_Pos                  _UINT32_(3)                                          /* (PAC_NONSECA) RSTC Non-Secure Position */
#define PAC_NONSECA_RSTC_Msk                  (_UINT32_(0x1) << PAC_NONSECA_RSTC_Pos)              /* (PAC_NONSECA) RSTC Non-Secure Mask */
#define PAC_NONSECA_RSTC(value)               (PAC_NONSECA_RSTC_Msk & (_UINT32_(value) << PAC_NONSECA_RSTC_Pos)) /* Assigment of value for RSTC in the PAC_NONSECA register */
#define PAC_NONSECA_OSCCTRL_Pos               _UINT32_(4)                                          /* (PAC_NONSECA) OSCCTRL Non-Secure Position */
#define PAC_NONSECA_OSCCTRL_Msk               (_UINT32_(0x1) << PAC_NONSECA_OSCCTRL_Pos)           /* (PAC_NONSECA) OSCCTRL Non-Secure Mask */
#define PAC_NONSECA_OSCCTRL(value)            (PAC_NONSECA_OSCCTRL_Msk & (_UINT32_(value) << PAC_NONSECA_OSCCTRL_Pos)) /* Assigment of value for OSCCTRL in the PAC_NONSECA register */
#define PAC_NONSECA_OSC32KCTRL_Pos            _UINT32_(5)                                          /* (PAC_NONSECA) OSC32KCTRL Non-Secure Position */
#define PAC_NONSECA_OSC32KCTRL_Msk            (_UINT32_(0x1) << PAC_NONSECA_OSC32KCTRL_Pos)        /* (PAC_NONSECA) OSC32KCTRL Non-Secure Mask */
#define PAC_NONSECA_OSC32KCTRL(value)         (PAC_NONSECA_OSC32KCTRL_Msk & (_UINT32_(value) << PAC_NONSECA_OSC32KCTRL_Pos)) /* Assigment of value for OSC32KCTRL in the PAC_NONSECA register */
#define PAC_NONSECA_SUPC_Pos                  _UINT32_(6)                                          /* (PAC_NONSECA) SUPC Non-Secure Position */
#define PAC_NONSECA_SUPC_Msk                  (_UINT32_(0x1) << PAC_NONSECA_SUPC_Pos)              /* (PAC_NONSECA) SUPC Non-Secure Mask */
#define PAC_NONSECA_SUPC(value)               (PAC_NONSECA_SUPC_Msk & (_UINT32_(value) << PAC_NONSECA_SUPC_Pos)) /* Assigment of value for SUPC in the PAC_NONSECA register */
#define PAC_NONSECA_GCLK_Pos                  _UINT32_(7)                                          /* (PAC_NONSECA) GCLK Non-Secure Position */
#define PAC_NONSECA_GCLK_Msk                  (_UINT32_(0x1) << PAC_NONSECA_GCLK_Pos)              /* (PAC_NONSECA) GCLK Non-Secure Mask */
#define PAC_NONSECA_GCLK(value)               (PAC_NONSECA_GCLK_Msk & (_UINT32_(value) << PAC_NONSECA_GCLK_Pos)) /* Assigment of value for GCLK in the PAC_NONSECA register */
#define PAC_NONSECA_WDT_Pos                   _UINT32_(8)                                          /* (PAC_NONSECA) WDT Non-Secure Position */
#define PAC_NONSECA_WDT_Msk                   (_UINT32_(0x1) << PAC_NONSECA_WDT_Pos)               /* (PAC_NONSECA) WDT Non-Secure Mask */
#define PAC_NONSECA_WDT(value)                (PAC_NONSECA_WDT_Msk & (_UINT32_(value) << PAC_NONSECA_WDT_Pos)) /* Assigment of value for WDT in the PAC_NONSECA register */
#define PAC_NONSECA_RTC_Pos                   _UINT32_(9)                                          /* (PAC_NONSECA) RTC Non-Secure Position */
#define PAC_NONSECA_RTC_Msk                   (_UINT32_(0x1) << PAC_NONSECA_RTC_Pos)               /* (PAC_NONSECA) RTC Non-Secure Mask */
#define PAC_NONSECA_RTC(value)                (PAC_NONSECA_RTC_Msk & (_UINT32_(value) << PAC_NONSECA_RTC_Pos)) /* Assigment of value for RTC in the PAC_NONSECA register */
#define PAC_NONSECA_EIC_Pos                   _UINT32_(10)                                         /* (PAC_NONSECA) EIC Non-Secure Position */
#define PAC_NONSECA_EIC_Msk                   (_UINT32_(0x1) << PAC_NONSECA_EIC_Pos)               /* (PAC_NONSECA) EIC Non-Secure Mask */
#define PAC_NONSECA_EIC(value)                (PAC_NONSECA_EIC_Msk & (_UINT32_(value) << PAC_NONSECA_EIC_Pos)) /* Assigment of value for EIC in the PAC_NONSECA register */
#define PAC_NONSECA_FREQM_Pos                 _UINT32_(11)                                         /* (PAC_NONSECA) FREQM Non-Secure Position */
#define PAC_NONSECA_FREQM_Msk                 (_UINT32_(0x1) << PAC_NONSECA_FREQM_Pos)             /* (PAC_NONSECA) FREQM Non-Secure Mask */
#define PAC_NONSECA_FREQM(value)              (PAC_NONSECA_FREQM_Msk & (_UINT32_(value) << PAC_NONSECA_FREQM_Pos)) /* Assigment of value for FREQM in the PAC_NONSECA register */
#define PAC_NONSECA_PORT_Pos                  _UINT32_(12)                                         /* (PAC_NONSECA) PORT Non-Secure Position */
#define PAC_NONSECA_PORT_Msk                  (_UINT32_(0x1) << PAC_NONSECA_PORT_Pos)              /* (PAC_NONSECA) PORT Non-Secure Mask */
#define PAC_NONSECA_PORT(value)               (PAC_NONSECA_PORT_Msk & (_UINT32_(value) << PAC_NONSECA_PORT_Pos)) /* Assigment of value for PORT in the PAC_NONSECA register */
#define PAC_NONSECA_AC_Pos                    _UINT32_(13)                                         /* (PAC_NONSECA) AC Non-Secure Position */
#define PAC_NONSECA_AC_Msk                    (_UINT32_(0x1) << PAC_NONSECA_AC_Pos)                /* (PAC_NONSECA) AC Non-Secure Mask */
#define PAC_NONSECA_AC(value)                 (PAC_NONSECA_AC_Msk & (_UINT32_(value) << PAC_NONSECA_AC_Pos)) /* Assigment of value for AC in the PAC_NONSECA register */
#define PAC_NONSECA_Msk                       _UINT32_(0x00003FFF)                                 /* (PAC_NONSECA) Register Mask  */


/* -------- PAC_NONSECB : (PAC Offset: 0x58) ( R/ 32) Peripheral non-secure status - Bridge B -------- */
#define PAC_NONSECB_RESETVALUE                _UINT32_(0x02)                                       /*  (PAC_NONSECB) Peripheral non-secure status - Bridge B  Reset Value */

#define PAC_NONSECB_IDAU_Pos                  _UINT32_(0)                                          /* (PAC_NONSECB) IDAU Non-Secure Position */
#define PAC_NONSECB_IDAU_Msk                  (_UINT32_(0x1) << PAC_NONSECB_IDAU_Pos)              /* (PAC_NONSECB) IDAU Non-Secure Mask */
#define PAC_NONSECB_IDAU(value)               (PAC_NONSECB_IDAU_Msk & (_UINT32_(value) << PAC_NONSECB_IDAU_Pos)) /* Assigment of value for IDAU in the PAC_NONSECB register */
#define PAC_NONSECB_DSU_Pos                   _UINT32_(1)                                          /* (PAC_NONSECB) DSU Non-Secure Position */
#define PAC_NONSECB_DSU_Msk                   (_UINT32_(0x1) << PAC_NONSECB_DSU_Pos)               /* (PAC_NONSECB) DSU Non-Secure Mask */
#define PAC_NONSECB_DSU(value)                (PAC_NONSECB_DSU_Msk & (_UINT32_(value) << PAC_NONSECB_DSU_Pos)) /* Assigment of value for DSU in the PAC_NONSECB register */
#define PAC_NONSECB_NVMCTRL_Pos               _UINT32_(2)                                          /* (PAC_NONSECB) NVMCTRL Non-Secure Position */
#define PAC_NONSECB_NVMCTRL_Msk               (_UINT32_(0x1) << PAC_NONSECB_NVMCTRL_Pos)           /* (PAC_NONSECB) NVMCTRL Non-Secure Mask */
#define PAC_NONSECB_NVMCTRL(value)            (PAC_NONSECB_NVMCTRL_Msk & (_UINT32_(value) << PAC_NONSECB_NVMCTRL_Pos)) /* Assigment of value for NVMCTRL in the PAC_NONSECB register */
#define PAC_NONSECB_DMAC_Pos                  _UINT32_(3)                                          /* (PAC_NONSECB) DMAC Non-Secure Position */
#define PAC_NONSECB_DMAC_Msk                  (_UINT32_(0x1) << PAC_NONSECB_DMAC_Pos)              /* (PAC_NONSECB) DMAC Non-Secure Mask */
#define PAC_NONSECB_DMAC(value)               (PAC_NONSECB_DMAC_Msk & (_UINT32_(value) << PAC_NONSECB_DMAC_Pos)) /* Assigment of value for DMAC in the PAC_NONSECB register */
#define PAC_NONSECB_HMATRIXHS_Pos             _UINT32_(4)                                          /* (PAC_NONSECB) HMATRIXHS Non-Secure Position */
#define PAC_NONSECB_HMATRIXHS_Msk             (_UINT32_(0x1) << PAC_NONSECB_HMATRIXHS_Pos)         /* (PAC_NONSECB) HMATRIXHS Non-Secure Mask */
#define PAC_NONSECB_HMATRIXHS(value)          (PAC_NONSECB_HMATRIXHS_Msk & (_UINT32_(value) << PAC_NONSECB_HMATRIXHS_Pos)) /* Assigment of value for HMATRIXHS in the PAC_NONSECB register */
#define PAC_NONSECB_USB_Pos                   _UINT32_(5)                                          /* (PAC_NONSECB) USB Non-Secure Position */
#define PAC_NONSECB_USB_Msk                   (_UINT32_(0x1) << PAC_NONSECB_USB_Pos)               /* (PAC_NONSECB) USB Non-Secure Mask */
#define PAC_NONSECB_USB(value)                (PAC_NONSECB_USB_Msk & (_UINT32_(value) << PAC_NONSECB_USB_Pos)) /* Assigment of value for USB in the PAC_NONSECB register */
#define PAC_NONSECB_Msk                       _UINT32_(0x0000003F)                                 /* (PAC_NONSECB) Register Mask  */


/* -------- PAC_NONSECC : (PAC Offset: 0x5C) ( R/ 32) Peripheral non-secure status - Bridge C -------- */
#define PAC_NONSECC_RESETVALUE                _UINT32_(0x00)                                       /*  (PAC_NONSECC) Peripheral non-secure status - Bridge C  Reset Value */

#define PAC_NONSECC_EVSYS_Pos                 _UINT32_(0)                                          /* (PAC_NONSECC) EVSYS Non-Secure Position */
#define PAC_NONSECC_EVSYS_Msk                 (_UINT32_(0x1) << PAC_NONSECC_EVSYS_Pos)             /* (PAC_NONSECC) EVSYS Non-Secure Mask */
#define PAC_NONSECC_EVSYS(value)              (PAC_NONSECC_EVSYS_Msk & (_UINT32_(value) << PAC_NONSECC_EVSYS_Pos)) /* Assigment of value for EVSYS in the PAC_NONSECC register */
#define PAC_NONSECC_SERCOM0_Pos               _UINT32_(1)                                          /* (PAC_NONSECC) SERCOM0 Non-Secure Position */
#define PAC_NONSECC_SERCOM0_Msk               (_UINT32_(0x1) << PAC_NONSECC_SERCOM0_Pos)           /* (PAC_NONSECC) SERCOM0 Non-Secure Mask */
#define PAC_NONSECC_SERCOM0(value)            (PAC_NONSECC_SERCOM0_Msk & (_UINT32_(value) << PAC_NONSECC_SERCOM0_Pos)) /* Assigment of value for SERCOM0 in the PAC_NONSECC register */
#define PAC_NONSECC_SERCOM1_Pos               _UINT32_(2)                                          /* (PAC_NONSECC) SERCOM1 Non-Secure Position */
#define PAC_NONSECC_SERCOM1_Msk               (_UINT32_(0x1) << PAC_NONSECC_SERCOM1_Pos)           /* (PAC_NONSECC) SERCOM1 Non-Secure Mask */
#define PAC_NONSECC_SERCOM1(value)            (PAC_NONSECC_SERCOM1_Msk & (_UINT32_(value) << PAC_NONSECC_SERCOM1_Pos)) /* Assigment of value for SERCOM1 in the PAC_NONSECC register */
#define PAC_NONSECC_SERCOM2_Pos               _UINT32_(3)                                          /* (PAC_NONSECC) SERCOM2 Non-Secure Position */
#define PAC_NONSECC_SERCOM2_Msk               (_UINT32_(0x1) << PAC_NONSECC_SERCOM2_Pos)           /* (PAC_NONSECC) SERCOM2 Non-Secure Mask */
#define PAC_NONSECC_SERCOM2(value)            (PAC_NONSECC_SERCOM2_Msk & (_UINT32_(value) << PAC_NONSECC_SERCOM2_Pos)) /* Assigment of value for SERCOM2 in the PAC_NONSECC register */
#define PAC_NONSECC_SERCOM3_Pos               _UINT32_(4)                                          /* (PAC_NONSECC) SERCOM3 Non-Secure Position */
#define PAC_NONSECC_SERCOM3_Msk               (_UINT32_(0x1) << PAC_NONSECC_SERCOM3_Pos)           /* (PAC_NONSECC) SERCOM3 Non-Secure Mask */
#define PAC_NONSECC_SERCOM3(value)            (PAC_NONSECC_SERCOM3_Msk & (_UINT32_(value) << PAC_NONSECC_SERCOM3_Pos)) /* Assigment of value for SERCOM3 in the PAC_NONSECC register */
#define PAC_NONSECC_SERCOM4_Pos               _UINT32_(5)                                          /* (PAC_NONSECC) SERCOM4 Non-Secure Position */
#define PAC_NONSECC_SERCOM4_Msk               (_UINT32_(0x1) << PAC_NONSECC_SERCOM4_Pos)           /* (PAC_NONSECC) SERCOM4 Non-Secure Mask */
#define PAC_NONSECC_SERCOM4(value)            (PAC_NONSECC_SERCOM4_Msk & (_UINT32_(value) << PAC_NONSECC_SERCOM4_Pos)) /* Assigment of value for SERCOM4 in the PAC_NONSECC register */
#define PAC_NONSECC_SERCOM5_Pos               _UINT32_(6)                                          /* (PAC_NONSECC) SERCOM5 Non-Secure Position */
#define PAC_NONSECC_SERCOM5_Msk               (_UINT32_(0x1) << PAC_NONSECC_SERCOM5_Pos)           /* (PAC_NONSECC) SERCOM5 Non-Secure Mask */
#define PAC_NONSECC_SERCOM5(value)            (PAC_NONSECC_SERCOM5_Msk & (_UINT32_(value) << PAC_NONSECC_SERCOM5_Pos)) /* Assigment of value for SERCOM5 in the PAC_NONSECC register */
#define PAC_NONSECC_TC0_Pos                   _UINT32_(7)                                          /* (PAC_NONSECC) TC0 Non-Secure Position */
#define PAC_NONSECC_TC0_Msk                   (_UINT32_(0x1) << PAC_NONSECC_TC0_Pos)               /* (PAC_NONSECC) TC0 Non-Secure Mask */
#define PAC_NONSECC_TC0(value)                (PAC_NONSECC_TC0_Msk & (_UINT32_(value) << PAC_NONSECC_TC0_Pos)) /* Assigment of value for TC0 in the PAC_NONSECC register */
#define PAC_NONSECC_TC1_Pos                   _UINT32_(8)                                          /* (PAC_NONSECC) TC1 Non-Secure Position */
#define PAC_NONSECC_TC1_Msk                   (_UINT32_(0x1) << PAC_NONSECC_TC1_Pos)               /* (PAC_NONSECC) TC1 Non-Secure Mask */
#define PAC_NONSECC_TC1(value)                (PAC_NONSECC_TC1_Msk & (_UINT32_(value) << PAC_NONSECC_TC1_Pos)) /* Assigment of value for TC1 in the PAC_NONSECC register */
#define PAC_NONSECC_TC2_Pos                   _UINT32_(9)                                          /* (PAC_NONSECC) TC2 Non-Secure Position */
#define PAC_NONSECC_TC2_Msk                   (_UINT32_(0x1) << PAC_NONSECC_TC2_Pos)               /* (PAC_NONSECC) TC2 Non-Secure Mask */
#define PAC_NONSECC_TC2(value)                (PAC_NONSECC_TC2_Msk & (_UINT32_(value) << PAC_NONSECC_TC2_Pos)) /* Assigment of value for TC2 in the PAC_NONSECC register */
#define PAC_NONSECC_TCC0_Pos                  _UINT32_(10)                                         /* (PAC_NONSECC) TCC0 Non-Secure Position */
#define PAC_NONSECC_TCC0_Msk                  (_UINT32_(0x1) << PAC_NONSECC_TCC0_Pos)              /* (PAC_NONSECC) TCC0 Non-Secure Mask */
#define PAC_NONSECC_TCC0(value)               (PAC_NONSECC_TCC0_Msk & (_UINT32_(value) << PAC_NONSECC_TCC0_Pos)) /* Assigment of value for TCC0 in the PAC_NONSECC register */
#define PAC_NONSECC_TCC1_Pos                  _UINT32_(11)                                         /* (PAC_NONSECC) TCC1 Non-Secure Position */
#define PAC_NONSECC_TCC1_Msk                  (_UINT32_(0x1) << PAC_NONSECC_TCC1_Pos)              /* (PAC_NONSECC) TCC1 Non-Secure Mask */
#define PAC_NONSECC_TCC1(value)               (PAC_NONSECC_TCC1_Msk & (_UINT32_(value) << PAC_NONSECC_TCC1_Pos)) /* Assigment of value for TCC1 in the PAC_NONSECC register */
#define PAC_NONSECC_TCC2_Pos                  _UINT32_(12)                                         /* (PAC_NONSECC) TCC2 Non-Secure Position */
#define PAC_NONSECC_TCC2_Msk                  (_UINT32_(0x1) << PAC_NONSECC_TCC2_Pos)              /* (PAC_NONSECC) TCC2 Non-Secure Mask */
#define PAC_NONSECC_TCC2(value)               (PAC_NONSECC_TCC2_Msk & (_UINT32_(value) << PAC_NONSECC_TCC2_Pos)) /* Assigment of value for TCC2 in the PAC_NONSECC register */
#define PAC_NONSECC_TCC3_Pos                  _UINT32_(13)                                         /* (PAC_NONSECC) TCC3 Non-Secure Position */
#define PAC_NONSECC_TCC3_Msk                  (_UINT32_(0x1) << PAC_NONSECC_TCC3_Pos)              /* (PAC_NONSECC) TCC3 Non-Secure Mask */
#define PAC_NONSECC_TCC3(value)               (PAC_NONSECC_TCC3_Msk & (_UINT32_(value) << PAC_NONSECC_TCC3_Pos)) /* Assigment of value for TCC3 in the PAC_NONSECC register */
#define PAC_NONSECC_ADC_Pos                   _UINT32_(14)                                         /* (PAC_NONSECC) ADC Non-Secure Position */
#define PAC_NONSECC_ADC_Msk                   (_UINT32_(0x1) << PAC_NONSECC_ADC_Pos)               /* (PAC_NONSECC) ADC Non-Secure Mask */
#define PAC_NONSECC_ADC(value)                (PAC_NONSECC_ADC_Msk & (_UINT32_(value) << PAC_NONSECC_ADC_Pos)) /* Assigment of value for ADC in the PAC_NONSECC register */
#define PAC_NONSECC_DAC_Pos                   _UINT32_(15)                                         /* (PAC_NONSECC) DAC Non-Secure Position */
#define PAC_NONSECC_DAC_Msk                   (_UINT32_(0x1) << PAC_NONSECC_DAC_Pos)               /* (PAC_NONSECC) DAC Non-Secure Mask */
#define PAC_NONSECC_DAC(value)                (PAC_NONSECC_DAC_Msk & (_UINT32_(value) << PAC_NONSECC_DAC_Pos)) /* Assigment of value for DAC in the PAC_NONSECC register */
#define PAC_NONSECC_PTC_Pos                   _UINT32_(16)                                         /* (PAC_NONSECC) PTC Non-Secure Position */
#define PAC_NONSECC_PTC_Msk                   (_UINT32_(0x1) << PAC_NONSECC_PTC_Pos)               /* (PAC_NONSECC) PTC Non-Secure Mask */
#define PAC_NONSECC_PTC(value)                (PAC_NONSECC_PTC_Msk & (_UINT32_(value) << PAC_NONSECC_PTC_Pos)) /* Assigment of value for PTC in the PAC_NONSECC register */
#define PAC_NONSECC_TRNG_Pos                  _UINT32_(17)                                         /* (PAC_NONSECC) TRNG Non-Secure Position */
#define PAC_NONSECC_TRNG_Msk                  (_UINT32_(0x1) << PAC_NONSECC_TRNG_Pos)              /* (PAC_NONSECC) TRNG Non-Secure Mask */
#define PAC_NONSECC_TRNG(value)               (PAC_NONSECC_TRNG_Msk & (_UINT32_(value) << PAC_NONSECC_TRNG_Pos)) /* Assigment of value for TRNG in the PAC_NONSECC register */
#define PAC_NONSECC_CCL_Pos                   _UINT32_(18)                                         /* (PAC_NONSECC) CCL Non-Secure Position */
#define PAC_NONSECC_CCL_Msk                   (_UINT32_(0x1) << PAC_NONSECC_CCL_Pos)               /* (PAC_NONSECC) CCL Non-Secure Mask */
#define PAC_NONSECC_CCL(value)                (PAC_NONSECC_CCL_Msk & (_UINT32_(value) << PAC_NONSECC_CCL_Pos)) /* Assigment of value for CCL in the PAC_NONSECC register */
#define PAC_NONSECC_I2S_Pos                   _UINT32_(19)                                         /* (PAC_NONSECC) I2S Non-Secure Position */
#define PAC_NONSECC_I2S_Msk                   (_UINT32_(0x1) << PAC_NONSECC_I2S_Pos)               /* (PAC_NONSECC) I2S Non-Secure Mask */
#define PAC_NONSECC_I2S(value)                (PAC_NONSECC_I2S_Msk & (_UINT32_(value) << PAC_NONSECC_I2S_Pos)) /* Assigment of value for I2S in the PAC_NONSECC register */
#define PAC_NONSECC_OPAMP_Pos                 _UINT32_(20)                                         /* (PAC_NONSECC) OPAMP Non-Secure Position */
#define PAC_NONSECC_OPAMP_Msk                 (_UINT32_(0x1) << PAC_NONSECC_OPAMP_Pos)             /* (PAC_NONSECC) OPAMP Non-Secure Mask */
#define PAC_NONSECC_OPAMP(value)              (PAC_NONSECC_OPAMP_Msk & (_UINT32_(value) << PAC_NONSECC_OPAMP_Pos)) /* Assigment of value for OPAMP in the PAC_NONSECC register */
#define PAC_NONSECC_TRAM_Pos                  _UINT32_(21)                                         /* (PAC_NONSECC) TRAM Non-Secure Position */
#define PAC_NONSECC_TRAM_Msk                  (_UINT32_(0x1) << PAC_NONSECC_TRAM_Pos)              /* (PAC_NONSECC) TRAM Non-Secure Mask */
#define PAC_NONSECC_TRAM(value)               (PAC_NONSECC_TRAM_Msk & (_UINT32_(value) << PAC_NONSECC_TRAM_Pos)) /* Assigment of value for TRAM in the PAC_NONSECC register */
#define PAC_NONSECC_Msk                       _UINT32_(0x003FFFFF)                                 /* (PAC_NONSECC) Register Mask  */

#define PAC_NONSECC_SERCOM_Pos                _UINT32_(1)                                          /* (PAC_NONSECC Position) SERCOMx Non-Secure */
#define PAC_NONSECC_SERCOM_Msk                (_UINT32_(0x3F) << PAC_NONSECC_SERCOM_Pos)           /* (PAC_NONSECC Mask) SERCOM */
#define PAC_NONSECC_SERCOM(value)             (PAC_NONSECC_SERCOM_Msk & (_UINT32_(value) << PAC_NONSECC_SERCOM_Pos)) 
#define PAC_NONSECC_TC_Pos                    _UINT32_(7)                                          /* (PAC_NONSECC Position) TCx Non-Secure */
#define PAC_NONSECC_TC_Msk                    (_UINT32_(0x7) << PAC_NONSECC_TC_Pos)                /* (PAC_NONSECC Mask) TC */
#define PAC_NONSECC_TC(value)                 (PAC_NONSECC_TC_Msk & (_UINT32_(value) << PAC_NONSECC_TC_Pos)) 
#define PAC_NONSECC_TCC_Pos                   _UINT32_(10)                                         /* (PAC_NONSECC Position) TCCx Non-Secure */
#define PAC_NONSECC_TCC_Msk                   (_UINT32_(0xF) << PAC_NONSECC_TCC_Pos)               /* (PAC_NONSECC Mask) TCC */
#define PAC_NONSECC_TCC(value)                (PAC_NONSECC_TCC_Msk & (_UINT32_(value) << PAC_NONSECC_TCC_Pos)) 

