Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_cnano/pic32cm_ls00_map_examples/begin/systick_periodic_timeout/firmware/systick_periodic_timeout_secure/src/packs/PIC32CM5164LS00048_DFP/component/pac.h
#define PAC_SECLOCKB_IDAU_Pos                 _UINT32_(0)                                          /* (PAC_SECLOCKB) IDAU Secure Status Locked Position */
#define PAC_SECLOCKB_IDAU_Msk                 (_UINT32_(0x1) << PAC_SECLOCKB_IDAU_Pos)             /* (PAC_SECLOCKB) IDAU Secure Status Locked Mask */
#define PAC_SECLOCKB_IDAU(value)              (PAC_SECLOCKB_IDAU_Msk & (_UINT32_(value) << PAC_SECLOCKB_IDAU_Pos)) /* Assigment of value for IDAU in the PAC_SECLOCKB register */
#define PAC_SECLOCKB_DSU_Pos                  _UINT32_(1)                                          /* (PAC_SECLOCKB) DSU Secure Status Locked Position */
#define PAC_SECLOCKB_DSU_Msk                  (_UINT32_(0x1) << PAC_SECLOCKB_DSU_Pos)              /* (PAC_SECLOCKB) DSU Secure Status Locked Mask */
#define PAC_SECLOCKB_DSU(value)               (PAC_SECLOCKB_DSU_Msk & (_UINT32_(value) << PAC_SECLOCKB_DSU_Pos)) /* Assigment of value for DSU in the PAC_SECLOCKB register */
#define PAC_SECLOCKB_NVMCTRL_Pos              _UINT32_(2)                                          /* (PAC_SECLOCKB) NVMCTRL Secure Status Locked Position */
#define PAC_SECLOCKB_NVMCTRL_Msk              (_UINT32_(0x1) << PAC_SECLOCKB_NVMCTRL_Pos)          /* (PAC_SECLOCKB) NVMCTRL Secure Status Locked Mask */
#define PAC_SECLOCKB_NVMCTRL(value)           (PAC_SECLOCKB_NVMCTRL_Msk & (_UINT32_(value) << PAC_SECLOCKB_NVMCTRL_Pos)) /* Assigment of value for NVMCTRL in the PAC_SECLOCKB register */
#define PAC_SECLOCKB_DMAC_Pos                 _UINT32_(3)                                          /* (PAC_SECLOCKB) DMAC Secure Status Locked Position */
#define PAC_SECLOCKB_DMAC_Msk                 (_UINT32_(0x1) << PAC_SECLOCKB_DMAC_Pos)             /* (PAC_SECLOCKB) DMAC Secure Status Locked Mask */
#define PAC_SECLOCKB_DMAC(value)              (PAC_SECLOCKB_DMAC_Msk & (_UINT32_(value) << PAC_SECLOCKB_DMAC_Pos)) /* Assigment of value for DMAC in the PAC_SECLOCKB register */
#define PAC_SECLOCKB_HMATRIXHS_Pos            _UINT32_(4)                                          /* (PAC_SECLOCKB) HMATRIXHS Secure Status Locked Position */
#define PAC_SECLOCKB_HMATRIXHS_Msk            (_UINT32_(0x1) << PAC_SECLOCKB_HMATRIXHS_Pos)        /* (PAC_SECLOCKB) HMATRIXHS Secure Status Locked Mask */
#define PAC_SECLOCKB_HMATRIXHS(value)         (PAC_SECLOCKB_HMATRIXHS_Msk & (_UINT32_(value) << PAC_SECLOCKB_HMATRIXHS_Pos)) /* Assigment of value for HMATRIXHS in the PAC_SECLOCKB register */
#define PAC_SECLOCKB_USB_Pos                  _UINT32_(5)                                          /* (PAC_SECLOCKB) USB Secure Status Locked Position */
#define PAC_SECLOCKB_USB_Msk                  (_UINT32_(0x1) << PAC_SECLOCKB_USB_Pos)              /* (PAC_SECLOCKB) USB Secure Status Locked Mask */
#define PAC_SECLOCKB_USB(value)               (PAC_SECLOCKB_USB_Msk & (_UINT32_(value) << PAC_SECLOCKB_USB_Pos)) /* Assigment of value for USB in the PAC_SECLOCKB register */
#define PAC_SECLOCKB_Msk                      _UINT32_(0x0000003F)                                 /* (PAC_SECLOCKB) Register Mask  */


/* -------- PAC_SECLOCKC : (PAC Offset: 0x7C) ( R/ 32) Peripheral secure status locked - Bridge C -------- */
#define PAC_SECLOCKC_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_SECLOCKC) Peripheral secure status locked - Bridge C  Reset Value */

#define PAC_SECLOCKC_EVSYS_Pos                _UINT32_(0)                                          /* (PAC_SECLOCKC) EVSYS Secure Status Locked Position */
#define PAC_SECLOCKC_EVSYS_Msk                (_UINT32_(0x1) << PAC_SECLOCKC_EVSYS_Pos)            /* (PAC_SECLOCKC) EVSYS Secure Status Locked Mask */
#define PAC_SECLOCKC_EVSYS(value)             (PAC_SECLOCKC_EVSYS_Msk & (_UINT32_(value) << PAC_SECLOCKC_EVSYS_Pos)) /* Assigment of value for EVSYS in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_SERCOM0_Pos              _UINT32_(1)                                          /* (PAC_SECLOCKC) SERCOM0 Secure Status Locked Position */
#define PAC_SECLOCKC_SERCOM0_Msk              (_UINT32_(0x1) << PAC_SECLOCKC_SERCOM0_Pos)          /* (PAC_SECLOCKC) SERCOM0 Secure Status Locked Mask */
#define PAC_SECLOCKC_SERCOM0(value)           (PAC_SECLOCKC_SERCOM0_Msk & (_UINT32_(value) << PAC_SECLOCKC_SERCOM0_Pos)) /* Assigment of value for SERCOM0 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_SERCOM1_Pos              _UINT32_(2)                                          /* (PAC_SECLOCKC) SERCOM1 Secure Status Locked Position */
#define PAC_SECLOCKC_SERCOM1_Msk              (_UINT32_(0x1) << PAC_SECLOCKC_SERCOM1_Pos)          /* (PAC_SECLOCKC) SERCOM1 Secure Status Locked Mask */
#define PAC_SECLOCKC_SERCOM1(value)           (PAC_SECLOCKC_SERCOM1_Msk & (_UINT32_(value) << PAC_SECLOCKC_SERCOM1_Pos)) /* Assigment of value for SERCOM1 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_SERCOM2_Pos              _UINT32_(3)                                          /* (PAC_SECLOCKC) SERCOM2 Secure Status Locked Position */
#define PAC_SECLOCKC_SERCOM2_Msk              (_UINT32_(0x1) << PAC_SECLOCKC_SERCOM2_Pos)          /* (PAC_SECLOCKC) SERCOM2 Secure Status Locked Mask */
#define PAC_SECLOCKC_SERCOM2(value)           (PAC_SECLOCKC_SERCOM2_Msk & (_UINT32_(value) << PAC_SECLOCKC_SERCOM2_Pos)) /* Assigment of value for SERCOM2 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_SERCOM3_Pos              _UINT32_(4)                                          /* (PAC_SECLOCKC) SERCOM3 Secure Status Locked Position */
#define PAC_SECLOCKC_SERCOM3_Msk              (_UINT32_(0x1) << PAC_SECLOCKC_SERCOM3_Pos)          /* (PAC_SECLOCKC) SERCOM3 Secure Status Locked Mask */
#define PAC_SECLOCKC_SERCOM3(value)           (PAC_SECLOCKC_SERCOM3_Msk & (_UINT32_(value) << PAC_SECLOCKC_SERCOM3_Pos)) /* Assigment of value for SERCOM3 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_SERCOM4_Pos              _UINT32_(5)                                          /* (PAC_SECLOCKC) SERCOM4 Secure Status Locked Position */
#define PAC_SECLOCKC_SERCOM4_Msk              (_UINT32_(0x1) << PAC_SECLOCKC_SERCOM4_Pos)          /* (PAC_SECLOCKC) SERCOM4 Secure Status Locked Mask */
#define PAC_SECLOCKC_SERCOM4(value)           (PAC_SECLOCKC_SERCOM4_Msk & (_UINT32_(value) << PAC_SECLOCKC_SERCOM4_Pos)) /* Assigment of value for SERCOM4 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_SERCOM5_Pos              _UINT32_(6)                                          /* (PAC_SECLOCKC) SERCOM5 Secure Status Locked Position */
#define PAC_SECLOCKC_SERCOM5_Msk              (_UINT32_(0x1) << PAC_SECLOCKC_SERCOM5_Pos)          /* (PAC_SECLOCKC) SERCOM5 Secure Status Locked Mask */
#define PAC_SECLOCKC_SERCOM5(value)           (PAC_SECLOCKC_SERCOM5_Msk & (_UINT32_(value) << PAC_SECLOCKC_SERCOM5_Pos)) /* Assigment of value for SERCOM5 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_TC0_Pos                  _UINT32_(7)                                          /* (PAC_SECLOCKC) TC0 Secure Status Locked Position */
#define PAC_SECLOCKC_TC0_Msk                  (_UINT32_(0x1) << PAC_SECLOCKC_TC0_Pos)              /* (PAC_SECLOCKC) TC0 Secure Status Locked Mask */
#define PAC_SECLOCKC_TC0(value)               (PAC_SECLOCKC_TC0_Msk & (_UINT32_(value) << PAC_SECLOCKC_TC0_Pos)) /* Assigment of value for TC0 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_TC1_Pos                  _UINT32_(8)                                          /* (PAC_SECLOCKC) TC1 Secure Status Locked Position */
#define PAC_SECLOCKC_TC1_Msk                  (_UINT32_(0x1) << PAC_SECLOCKC_TC1_Pos)              /* (PAC_SECLOCKC) TC1 Secure Status Locked Mask */
#define PAC_SECLOCKC_TC1(value)               (PAC_SECLOCKC_TC1_Msk & (_UINT32_(value) << PAC_SECLOCKC_TC1_Pos)) /* Assigment of value for TC1 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_TC2_Pos                  _UINT32_(9)                                          /* (PAC_SECLOCKC) TC2 Secure Status Locked Position */
#define PAC_SECLOCKC_TC2_Msk                  (_UINT32_(0x1) << PAC_SECLOCKC_TC2_Pos)              /* (PAC_SECLOCKC) TC2 Secure Status Locked Mask */
#define PAC_SECLOCKC_TC2(value)               (PAC_SECLOCKC_TC2_Msk & (_UINT32_(value) << PAC_SECLOCKC_TC2_Pos)) /* Assigment of value for TC2 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_TCC0_Pos                 _UINT32_(10)                                         /* (PAC_SECLOCKC) TCC0 Secure Status Locked Position */
#define PAC_SECLOCKC_TCC0_Msk                 (_UINT32_(0x1) << PAC_SECLOCKC_TCC0_Pos)             /* (PAC_SECLOCKC) TCC0 Secure Status Locked Mask */
#define PAC_SECLOCKC_TCC0(value)              (PAC_SECLOCKC_TCC0_Msk & (_UINT32_(value) << PAC_SECLOCKC_TCC0_Pos)) /* Assigment of value for TCC0 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_TCC1_Pos                 _UINT32_(11)                                         /* (PAC_SECLOCKC) TCC1 Secure Status Locked Position */
#define PAC_SECLOCKC_TCC1_Msk                 (_UINT32_(0x1) << PAC_SECLOCKC_TCC1_Pos)             /* (PAC_SECLOCKC) TCC1 Secure Status Locked Mask */
#define PAC_SECLOCKC_TCC1(value)              (PAC_SECLOCKC_TCC1_Msk & (_UINT32_(value) << PAC_SECLOCKC_TCC1_Pos)) /* Assigment of value for TCC1 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_TCC2_Pos                 _UINT32_(12)                                         /* (PAC_SECLOCKC) TCC2 Secure Status Locked Position */
#define PAC_SECLOCKC_TCC2_Msk                 (_UINT32_(0x1) << PAC_SECLOCKC_TCC2_Pos)             /* (PAC_SECLOCKC) TCC2 Secure Status Locked Mask */
#define PAC_SECLOCKC_TCC2(value)              (PAC_SECLOCKC_TCC2_Msk & (_UINT32_(value) << PAC_SECLOCKC_TCC2_Pos)) /* Assigment of value for TCC2 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_TCC3_Pos                 _UINT32_(13)                                         /* (PAC_SECLOCKC) TCC3 Secure Status Locked Position */
#define PAC_SECLOCKC_TCC3_Msk                 (_UINT32_(0x1) << PAC_SECLOCKC_TCC3_Pos)             /* (PAC_SECLOCKC) TCC3 Secure Status Locked Mask */
#define PAC_SECLOCKC_TCC3(value)              (PAC_SECLOCKC_TCC3_Msk & (_UINT32_(value) << PAC_SECLOCKC_TCC3_Pos)) /* Assigment of value for TCC3 in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_ADC_Pos                  _UINT32_(14)                                         /* (PAC_SECLOCKC) ADC Secure Status Locked Position */
#define PAC_SECLOCKC_ADC_Msk                  (_UINT32_(0x1) << PAC_SECLOCKC_ADC_Pos)              /* (PAC_SECLOCKC) ADC Secure Status Locked Mask */
#define PAC_SECLOCKC_ADC(value)               (PAC_SECLOCKC_ADC_Msk & (_UINT32_(value) << PAC_SECLOCKC_ADC_Pos)) /* Assigment of value for ADC in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_DAC_Pos                  _UINT32_(15)                                         /* (PAC_SECLOCKC) DAC Secure Status Locked Position */
#define PAC_SECLOCKC_DAC_Msk                  (_UINT32_(0x1) << PAC_SECLOCKC_DAC_Pos)              /* (PAC_SECLOCKC) DAC Secure Status Locked Mask */
#define PAC_SECLOCKC_DAC(value)               (PAC_SECLOCKC_DAC_Msk & (_UINT32_(value) << PAC_SECLOCKC_DAC_Pos)) /* Assigment of value for DAC in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_PTC_Pos                  _UINT32_(16)                                         /* (PAC_SECLOCKC) PTC Secure Status Locked Position */
#define PAC_SECLOCKC_PTC_Msk                  (_UINT32_(0x1) << PAC_SECLOCKC_PTC_Pos)              /* (PAC_SECLOCKC) PTC Secure Status Locked Mask */
#define PAC_SECLOCKC_PTC(value)               (PAC_SECLOCKC_PTC_Msk & (_UINT32_(value) << PAC_SECLOCKC_PTC_Pos)) /* Assigment of value for PTC in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_TRNG_Pos                 _UINT32_(17)                                         /* (PAC_SECLOCKC) TRNG Secure Status Locked Position */
#define PAC_SECLOCKC_TRNG_Msk                 (_UINT32_(0x1) << PAC_SECLOCKC_TRNG_Pos)             /* (PAC_SECLOCKC) TRNG Secure Status Locked Mask */
#define PAC_SECLOCKC_TRNG(value)              (PAC_SECLOCKC_TRNG_Msk & (_UINT32_(value) << PAC_SECLOCKC_TRNG_Pos)) /* Assigment of value for TRNG in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_CCL_Pos                  _UINT32_(18)                                         /* (PAC_SECLOCKC) CCL Secure Status Locked Position */
#define PAC_SECLOCKC_CCL_Msk                  (_UINT32_(0x1) << PAC_SECLOCKC_CCL_Pos)              /* (PAC_SECLOCKC) CCL Secure Status Locked Mask */
#define PAC_SECLOCKC_CCL(value)               (PAC_SECLOCKC_CCL_Msk & (_UINT32_(value) << PAC_SECLOCKC_CCL_Pos)) /* Assigment of value for CCL in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_I2S_Pos                  _UINT32_(19)                                         /* (PAC_SECLOCKC) I2S Secure Status Locked Position */
#define PAC_SECLOCKC_I2S_Msk                  (_UINT32_(0x1) << PAC_SECLOCKC_I2S_Pos)              /* (PAC_SECLOCKC) I2S Secure Status Locked Mask */
#define PAC_SECLOCKC_I2S(value)               (PAC_SECLOCKC_I2S_Msk & (_UINT32_(value) << PAC_SECLOCKC_I2S_Pos)) /* Assigment of value for I2S in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_OPAMP_Pos                _UINT32_(20)                                         /* (PAC_SECLOCKC) OPAMP Secure Status Locked Position */
#define PAC_SECLOCKC_OPAMP_Msk                (_UINT32_(0x1) << PAC_SECLOCKC_OPAMP_Pos)            /* (PAC_SECLOCKC) OPAMP Secure Status Locked Mask */
#define PAC_SECLOCKC_OPAMP(value)             (PAC_SECLOCKC_OPAMP_Msk & (_UINT32_(value) << PAC_SECLOCKC_OPAMP_Pos)) /* Assigment of value for OPAMP in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_TRAM_Pos                 _UINT32_(21)                                         /* (PAC_SECLOCKC) TRAM Secure Status Locked Position */
#define PAC_SECLOCKC_TRAM_Msk                 (_UINT32_(0x1) << PAC_SECLOCKC_TRAM_Pos)             /* (PAC_SECLOCKC) TRAM Secure Status Locked Mask */
#define PAC_SECLOCKC_TRAM(value)              (PAC_SECLOCKC_TRAM_Msk & (_UINT32_(value) << PAC_SECLOCKC_TRAM_Pos)) /* Assigment of value for TRAM in the PAC_SECLOCKC register */
#define PAC_SECLOCKC_Msk                      _UINT32_(0x003FFFFF)                                 /* (PAC_SECLOCKC) Register Mask  */

#define PAC_SECLOCKC_SERCOM_Pos               _UINT32_(1)                                          /* (PAC_SECLOCKC Position) SERCOMx Secure Status Locked */
#define PAC_SECLOCKC_SERCOM_Msk               (_UINT32_(0x3F) << PAC_SECLOCKC_SERCOM_Pos)          /* (PAC_SECLOCKC Mask) SERCOM */
#define PAC_SECLOCKC_SERCOM(value)            (PAC_SECLOCKC_SERCOM_Msk & (_UINT32_(value) << PAC_SECLOCKC_SERCOM_Pos)) 
#define PAC_SECLOCKC_TC_Pos                   _UINT32_(7)                                          /* (PAC_SECLOCKC Position) TCx Secure Status Locked */
#define PAC_SECLOCKC_TC_Msk                   (_UINT32_(0x7) << PAC_SECLOCKC_TC_Pos)               /* (PAC_SECLOCKC Mask) TC */
#define PAC_SECLOCKC_TC(value)                (PAC_SECLOCKC_TC_Msk & (_UINT32_(value) << PAC_SECLOCKC_TC_Pos)) 
#define PAC_SECLOCKC_TCC_Pos                  _UINT32_(10)                                         /* (PAC_SECLOCKC Position) TCCx Secure Status Locked */
#define PAC_SECLOCKC_TCC_Msk                  (_UINT32_(0xF) << PAC_SECLOCKC_TCC_Pos)              /* (PAC_SECLOCKC Mask) TCC */
#define PAC_SECLOCKC_TCC(value)               (PAC_SECLOCKC_TCC_Msk & (_UINT32_(value) << PAC_SECLOCKC_TCC_Pos)) 

/** \brief PAC register offsets definitions */
#define PAC_WRCTRL_REG_OFST            _UINT32_(0x00)      /* (PAC_WRCTRL) Write control Offset */
#define PAC_EVCTRL_REG_OFST            _UINT32_(0x04)      /* (PAC_EVCTRL) Event control Offset */
#define PAC_INTENCLR_REG_OFST          _UINT32_(0x08)      /* (PAC_INTENCLR) Interrupt enable clear Offset */
#define PAC_INTENSET_REG_OFST          _UINT32_(0x09)      /* (PAC_INTENSET) Interrupt enable set Offset */
#define PAC_INTFLAGAHB_REG_OFST        _UINT32_(0x10)      /* (PAC_INTFLAGAHB) Bridge interrupt flag status Offset */
#define PAC_INTFLAGA_REG_OFST          _UINT32_(0x14)      /* (PAC_INTFLAGA) Peripheral interrupt flag status - Bridge A Offset */
#define PAC_INTFLAGB_REG_OFST          _UINT32_(0x18)      /* (PAC_INTFLAGB) Peripheral interrupt flag status - Bridge B Offset */
#define PAC_INTFLAGC_REG_OFST          _UINT32_(0x1C)      /* (PAC_INTFLAGC) Peripheral interrupt flag status - Bridge C Offset */
#define PAC_STATUSA_REG_OFST           _UINT32_(0x34)      /* (PAC_STATUSA) Peripheral write protection status - Bridge A Offset */
#define PAC_STATUSB_REG_OFST           _UINT32_(0x38)      /* (PAC_STATUSB) Peripheral write protection status - Bridge B Offset */
#define PAC_STATUSC_REG_OFST           _UINT32_(0x3C)      /* (PAC_STATUSC) Peripheral write protection status - Bridge C Offset */
#define PAC_NONSECA_REG_OFST           _UINT32_(0x54)      /* (PAC_NONSECA) Peripheral non-secure status - Bridge A Offset */
#define PAC_NONSECB_REG_OFST           _UINT32_(0x58)      /* (PAC_NONSECB) Peripheral non-secure status - Bridge B Offset */
#define PAC_NONSECC_REG_OFST           _UINT32_(0x5C)      /* (PAC_NONSECC) Peripheral non-secure status - Bridge C Offset */
#define PAC_SECLOCKA_REG_OFST          _UINT32_(0x74)      /* (PAC_SECLOCKA) Peripheral secure status locked - Bridge A Offset */
#define PAC_SECLOCKB_REG_OFST          _UINT32_(0x78)      /* (PAC_SECLOCKB) Peripheral secure status locked - Bridge B Offset */
#define PAC_SECLOCKC_REG_OFST          _UINT32_(0x7C)      /* (PAC_SECLOCKC) Peripheral secure status locked - Bridge C Offset */

